In [3]:
import pandas as pd
import numpy as np

In [4]:
class display(object):
    template = """<div style="float: left; padding: 10px";">
    <p style='font-family: "Courier New", Courier, monospace'>{0}{1}"""
    def __init__(self, *args):
        self.args = args

    def _repr_html_(self):
        return '\n'.join(self.tempalte.format(a,eval(a)._repr_html_())
                         for a in self.args)

    def _repr_(self):
        return '\n\n'.join(a+'\n'+repr(eval(a))
                           for a in self.args)

In [5]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [6]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [8]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [11]:
ser.sum()

2.811925491708157

In [10]:
ser.min()

0.15601864044243652

In [13]:
df = pd.DataFrame({'A':rng.rand(5),
                  'B':rng.rand(5)})
df

          A         B
0  0.183405  0.611853
1  0.304242  0.139494
2  0.524756  0.292145
3  0.431945  0.366362
4  0.291229  0.456070

In [14]:
df.mean()

A    0.347115
B    0.373185
dtype: float64

In [15]:
df.mean(axis='columns')

0    0.397629
1    0.221868
2    0.408451
3    0.399153
4    0.373650
dtype: float64

In [16]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [17]:
 df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                   'data':range(6)}, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [18]:
df.groupby('key')

In [19]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [20]:
planets.groupby('method')

In [21]:
planets.groupby('method')['orbital_period']

In [23]:
planets.groupby('method')['orbital_period']

In [25]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [28]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [32]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [37]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                  'data1':range(6),
                  'data2':rng.randint(0,10,6)},
                 columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [ ]:
# АГРЕГИРОВАНИЕ

In [38]:
df.groupby('key').aggregate(['min', np.median, max])

/var/folders/w_/x158hy914jv595q6kdm333n80000gn/T/ipykernel_60287/968873422.py:1: FutureWarning: The provided callable <function median at 0x119529bc0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate(['min', np.median, max])
/var/folders/w_/x158hy914jv595q6kdm333n80000gn/T/ipykernel_60287/968873422.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [40]:
df.groupby('key').aggregate({'data1': 'min',
                           'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [47]:
#ФИЛЬТРАЦИЯ

In [61]:
def filter_func(x):
    return x['data2'].std()>4

display('df', "df.groupby('key').std()",
        "df.groupby('key').filter(filter_func)")

# Display DataFrame
display(df)

# Display groupby standard deviation
display(df.groupby('key').std())

# Display filtered groups
display(df.groupby('key').filter(filter_func))

'df'

"df.groupby('key').std()"

"df.groupby('key').filter(filter_func)"

  key  data1  data2
0   A      1     10
1   A      2     20
2   B      3     30
3   B      4     40
4   C      5     50
5   C      6     60

        data1     data2
key
A    0.707107  7.071068
B    0.707107  7.071068
C    0.707107  7.071068

  key  data1  data2
0   A      1     10
1   A      2     20
2   B      3     30
3   B      4     40
4   C      5     50
5   C      6     60

In [ ]:
#ПРЕОБРАЗОВАНИЕ

In [62]:
def center(x):
    return x - x.mean()
df.groupby('key').transform(center)

   data1  data2
0   -0.5   -5.0
1    0.5    5.0
2   -0.5   -5.0
3    0.5    5.0
4   -0.5   -5.0
5    0.5    5.0

In [ ]:
#МЕТОД APPLY()

In [63]:
def norm_by_data2(x):
    x['data1']/= x['data2'].sum()
    return x